Rokasbarasa1/STM32-Quadcopter/src/main.c
float roll_effect_on_lon = 0;
float pitch_effect_on_lon = 0;

int main(void){
    init_STM32_peripherals();

    // Turn off the blue led. Will show the status of sd logging later
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
    
    printf("STARTING PROGRAM\n"); 
    // calibrate_escs();
    if(init_sensors() == 0){
        return 0; // exit if initialization failed
    }

    accelerometer_roll_offset = base_accelerometer_roll_offset;
    accelerometer_pitch_offset = base_accelerometer_pitch_offset;

    HAL_Delay(2000); // Dont want to interfere in calibration

    // check_calibrations();
    calibrate_gyro(); // Recalibrate the gyro as the temperature affects the calibration
    get_initial_position();
    // setup_logging_to_sd(); // Hardware power issue currently
    initialize_control_abstractions();

    handle_pre_loop_start();
    while (1){
        handle_radio_communication();
        handle_get_and_calculate_sensor_values(); // Important do do this right before the pid stuff.
        handle_pid_and_motor_control();
        handle_logging();

        handle_loop_end();
    }
}

uint8_t init_sensors(){
    printf("-----------------------------INITIALIZING MODULES...\n");

    uint8_t mpu6050 = init_mpu6050(
        &hi2c1, 
        ACCEL_CONFIG_RANGE_2G, 
        GYRO_CONFIG_RANGE_250_DEG, 
        LOW_PASS_FILTER_FREQUENCY_CUTOFF_GYRO_21HZ_ACCEL_20HZ,
        1, 
        accelerometer_scale_factor_correction, 
        accelerometer_correction, 
        gyro_correction, 
        REFRESH_RATE_HZ, 
        complementary_ratio, 
        complementary_beta
    );

    uint8_t mmc5603 = mmc5603_init(&hi2c1, 1, hard_iron_correction, soft_iron_correction, 1, 200, 1);
    uint8_t bmp280 = init_bmp280(&hi2c1);
    uint8_t bn357 = init_bn357(&huart2, &hdma_usart2_rx, 1);
    uint8_t nrf24 = init_nrf24(&hspi1);

    printf("-----------------------------INITIALIZING MODULES DONE... ");

    if (mpu6050 && mmc5603 && bmp280 && bn357 && nrf24){
        printf("OK\n");
    }else{
        printf("NOT OK\n");
        return 0;
    }

    // Continue initializing
    nrf24_rx_mode(tx_address, 10);
    bn357_start_uart_interrupt();

    return 1;
}

void handle_get_and_calculate_sensor_values(){
    // ------------------------------------------------------------------------------------------------------ Reset
    // Reset the values to make it easier to find broken sensor later
    reset_array_data(acceleration_data, 3);
    reset_array_data(gyro_angular, 3);
    reset_array_data(magnetometer_data, 3);
    temperature = 0.0f;
    altitude = 0.0f;
    vertical_velocity = 0.0f;

    // ------------------------------------------------------------------------------------------------------ Get the sensor data
    temperature = bmp280_get_temperature_celsius();
    altitude = bmp280_get_height_centimeters_from_reference(0);
    
    if(bn357_get_status_up_to_date(1)) got_gps = 1; // Flag for logging
    else got_gps = 0;

    gps_latitude = bn357_get_latitude_decimal_format();
    gps_longitude = bn357_get_longitude_decimal_format();
    gps_fix_type = bn357_get_fix_type();

    if(gps_fix_type == 3){
        HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
    }else{
        HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
    }


    // Pitch (+)forwards - front of device nose goes down
    // Roll (+)right - the device banks to the right side while pointing forward
    mmc5603_magnetometer_readings_micro_teslas(magnetometer_data);
    rotate_magnetometer_output_90_degrees_anti_clockwise(magnetometer_data);
    // After yaw calculation yaw has to be 0/360 when facing north in the pitch+ axis
    mpu6050_get_accelerometer_readings_gravity(acceleration_data);
    invert_axies(acceleration_data);
    // After getting roll and pitch from accelerometer. Pitch forwards -> +Pitch. Roll right -> +Roll
    mpu6050_get_gyro_readings_dps(gyro_angular);
    invert_axies(gyro_angular);
    // Pitch device forwards -> Y axis positive. Roll device right -> X axis positive

    // If some of these above conditions are not met the tilt compensation on yaw will not work.
    // ------------------------------------------------------------------------------------------------------ Filter the sensor data

    magnetometer_data[0] = low_pass_filter_read(&filter_magnetometer_x, magnetometer_data[0]);
    magnetometer_data[1] = low_pass_filter_read(&filter_magnetometer_y, magnetometer_data[1]);
    magnetometer_data[2] = low_pass_filter_read(&filter_magnetometer_z, magnetometer_data[2]);

    // ------------------------------------------------------------------------------------------------------ Sensor fusion
    calculate_roll_pitch_from_accelerometer_data(acceleration_data, &accelerometer_roll, &accelerometer_pitch, accelerometer_roll_offset, accelerometer_pitch_offset); // Get roll and pitch from the data. I call it x and y. Ranges -90 to 90. 
    sensor_fusion_roll_pitch(gyro_angular, accelerometer_roll, accelerometer_pitch, HAL_GetTick(), 1, imu_orientation);

    // Sensor fusion imu degrees > accelerometer degrees
    calculate_yaw_tilt_compensated_using_magnetometer_data(magnetometer_data, &magnetometer_yaw, imu_orientation[0], imu_orientation[1]);

    // No need for sensor fusion, it introduces delay
    imu_orientation[2] = magnetometer_yaw;
    // printf("%f;\n", gyro_angular[2]);
    // 
    // Yaw = 0, Roll right, +latitude       
    // Yaw = 0, Roll left, -latitude        
    // Yaw = 0, Pitch forward, -longitude   
    // Yaw = 0, Pitch back, +longitude      
    // Roll component is 1 and pitch component is 1 also.
    // Roll component is 1 + sin(0deg) 

    // Yaw = 45, Roll right, +latitude +       
    // Yaw = 45, Roll left, -latitude        
    // Yaw = 45, Pitch forward, +longitude   
    // Yaw = 45, Pitch back, -longitude      
    // Roll component is 1 and pitch component is 1 also.

    // lat and lon effect on pitch and roll
    roll_effect_on_lat = cos(imu_orientation[2] * (M_PI / 180.0));
    pitch_effect_on_lat = sin(imu_orientation[2] * (M_PI / 180.0));

    roll_effect_on_lon = sin(imu_orientation[2] * (M_PI / 180.0));
    pitch_effect_on_lon = cos(imu_orientation[2] * (M_PI / 180.0));




    // After this calculations
    // Backwards increase imu_orientation[1] (Should decrease)
    // Forwards decrease imu_orientation[1] (Should increase)
    // Left increase imu_orientation[0]. (Should decrease based on standards)
    // Right decrease imu_orientation[0] (Should increase)



    // ------------------------------------------------------------------------------------------------------ Use sensor fused data for more data
    float vertical_acceleration[1] = {mpu6050_calculate_vertical_acceleration_cm_per_second(acceleration_data, imu_orientation)};
    float vertical_altitude[1] = {altitude};

