Rokasbarasa1/STM32-Quadcopter/src/main.c
    kalman_filter_predict(&altitude_and_velocity_kalman, vertical_acceleration);
    kalman_filter_update(&altitude_and_velocity_kalman, vertical_altitude);

    altitude = kalman_filter_get_state(&altitude_and_velocity_kalman)[0][0];
    vertical_velocity = kalman_filter_get_state(&altitude_and_velocity_kalman)[1][0];
    // printf("%f;%f;%f;%f;\n", vertical_acceleration[0], vertical_altitude[0], kalman_filter_get_state(&altitude_and_velocity_kalman)[0][0], kalman_filter_get_state(&altitude_and_velocity_kalman)[1][0]);
    
}


void handle_pid_and_motor_control(){
    // float error_altitude = mapValue(pid_get_error(&altitude_pid, altitude, HAL_GetTick()), -180.0, 180.0, -100.0, 100.0);
    // printf("Altitude error %6.2f ", error_altitude);
    
    // For the robot to do work it needs to be receiving radio signals and at the correct angles, facing up
    if(
        imu_orientation[0] <  30 && 
        imu_orientation[0] > -30 && 
        imu_orientation[1] <  30 && 
        imu_orientation[1] > -30 && 
        ((float)HAL_GetTick() - (float)last_signal_timestamp) / 1000.0 <= minimum_signal_timing_seconds
    ){
        // ----------------------------------------------------------------------------------------------OUTER LOOP PID
        if(gps_position_hold_enabled){
            pid_set_desired_value(&gps_latitude_pid, target_latitude);
            pid_set_desired_value(&gps_longitude_pid, target_longitude);

            error_latitude = pid_get_error(&gps_latitude_pid, gps_latitude, HAL_GetTick());
            error_longitude = pid_get_error(&gps_longitude_pid, gps_longitude, HAL_GetTick());

            gps_hold_roll_adjustment = roll_effect_on_lat * error_latitude + roll_effect_on_lon * error_longitude; // PITCH
            gps_hold_pitch_adjustment = pitch_effect_on_lat * error_latitude + pitch_effect_on_lon * error_longitude; // ROLL
            
            gps_hold_roll_adjustment = gps_hold_roll_adjustment * -1;
            
            printf("GPS target lat %.6f lon %.6f   ", target_latitude, target_longitude);
            printf("GPS actual lat %.6f lon %.6f   ", gps_latitude, gps_longitude);
            printf("GPS Pitch %f roll %f  ", gps_hold_roll_adjustment, gps_hold_pitch_adjustment);
            printf("Degrees: %.2f %.2f %.2f\n", imu_orientation[0], imu_orientation[1], imu_orientation[2]);
            
        }else{
            gps_hold_roll_adjustment = 0;
            gps_hold_pitch_adjustment = 0;
        }

        // ----------------------------------------------------------------------------------------------INNER LOOP PID
        pid_set_desired_value(&pitch_pid, target_pitch + gps_hold_pitch_adjustment);
        pid_set_desired_value(&roll_pid, target_roll + gps_hold_roll_adjustment);
        pid_set_desired_value(&yaw_pid, target_yaw);
        pid_set_desired_value(&vertical_velocity_pid, target_vertical_velocity);

        PID_set_points[0] = target_pitch; // Logging
        PID_set_points[1] = target_roll; // Logging
        PID_set_points[2] = target_yaw; // Logging

        // pitch is facing to the sides
        // roll is facing forwards and backwards

        error_roll = pid_get_error(&roll_pid, imu_orientation[0], HAL_GetTick());
        PID_proportional[1] = pid_get_last_proportional_error(&roll_pid); // Logging
        PID_integral[1] = pid_get_last_integral_error(&roll_pid); // Logging
        PID_derivative[1] = pid_get_last_derivative_error(&roll_pid); // Logging
        
        error_pitch = pid_get_error(&pitch_pid, imu_orientation[1], HAL_GetTick());
        PID_proportional[0] = pid_get_last_proportional_error(&pitch_pid); // Logging
        PID_integral[0] = pid_get_last_integral_error(&pitch_pid); // Logging
        PID_derivative[0] = pid_get_last_derivative_error(&pitch_pid); // Logging


        error_yaw = pid_get_error(&yaw_pid, gyro_angular[2], HAL_GetTick()); // Logging
        PID_proportional[2] = pid_get_last_proportional_error(&yaw_pid); // Logging
        PID_integral[2] = pid_get_last_integral_error(&yaw_pid); // Logging

        error_vertical_velocity = pid_get_error(&vertical_velocity_pid, vertical_velocity, HAL_GetTick());

        error_throttle = throttle*0.9;

        motor_power[0] = ( error_pitch) +  ( error_roll) + ( error_yaw);
        motor_power[1] = ( error_pitch) +  (-error_roll) + (-error_yaw);
        motor_power[2] = (-error_pitch) +  (-error_roll) + ( error_yaw);
        motor_power[3] = (-error_pitch) +  ( error_roll) + (-error_yaw);

        // For throttle control logic
        motor_power[0] += error_throttle * (~use_vertical_velocity_control & 1) + error_vertical_velocity * use_vertical_velocity_control;
        motor_power[1] += error_throttle * (~use_vertical_velocity_control & 1) + error_vertical_velocity * use_vertical_velocity_control;
        motor_power[2] += error_throttle * (~use_vertical_velocity_control & 1) + error_vertical_velocity * use_vertical_velocity_control;
        motor_power[3] += error_throttle * (~use_vertical_velocity_control & 1) + error_vertical_velocity * use_vertical_velocity_control;

        // Motor B (0) 14460 rpm
        // Motor C (1) 14160 rpm
        // Motor D (2) 14460 rpm
        // Motor A (3) 13740 rpm

        // GPS side BACK
        TIM2->CCR1 = setServoActivationPercent(motor_power[2], esc_lowest_motor_spin, actual_max_esc_pwm_value);
        TIM2->CCR2 = setServoActivationPercent(motor_power[3], esc_lowest_motor_spin, actual_max_esc_pwm_value);

        // No gps side FRONT
        TIM1->CCR1 = setServoActivationPercent(motor_power[0], esc_lowest_motor_spin, actual_max_esc_pwm_value);
        TIM1->CCR4 = setServoActivationPercent(motor_power[1], esc_lowest_motor_spin, actual_max_esc_pwm_value);
        
        // For logging
        motor_power[0] = setServoActivationPercent(motor_power[0], esc_lowest_motor_spin, actual_max_esc_pwm_value); // Logging
        motor_power[1] = setServoActivationPercent(motor_power[1], esc_lowest_motor_spin, actual_max_esc_pwm_value); // Logging
        motor_power[2] = setServoActivationPercent(motor_power[2], esc_lowest_motor_spin, actual_max_esc_pwm_value); // Logging
        motor_power[3] = setServoActivationPercent(motor_power[3], esc_lowest_motor_spin, actual_max_esc_pwm_value); // Logging
    }else{
        // GPS side
        TIM2->CCR1 = setServoActivationPercent(0, min_esc_pwm_value, actual_max_esc_pwm_value);
        TIM2->CCR2 = setServoActivationPercent(0, min_esc_pwm_value, actual_max_esc_pwm_value);

        // No gps side
        TIM1->CCR1 = setServoActivationPercent(0, min_esc_pwm_value, actual_max_esc_pwm_value);
        TIM1->CCR4 = setServoActivationPercent(0, min_esc_pwm_value, actual_max_esc_pwm_value);
        
