Rokasbarasa1/STM32-Quadcopter/src/main.c
        // Reset the remote control set points also
        remote_control[0] = 0;
        remote_control[1] = 50;
        remote_control[2] = 50;
        remote_control[3] = 50;

        motor_power[0] = setServoActivationPercent(0, min_esc_pwm_value, actual_max_esc_pwm_value); // Logging
        motor_power[1] = setServoActivationPercent(0, min_esc_pwm_value, actual_max_esc_pwm_value); // Logging
        motor_power[2] = setServoActivationPercent(0, min_esc_pwm_value, actual_max_esc_pwm_value); // Logging
        motor_power[3] = setServoActivationPercent(0, min_esc_pwm_value, actual_max_esc_pwm_value); // Logging

        PID_proportional[0] = 0;
        PID_proportional[1] = 0;
        PID_proportional[2] = 0;

        PID_integral[0] = 0;
        PID_integral[1] = 0;
        PID_integral[2] = 0;

        PID_derivative[0] = 0;
        PID_derivative[1] = 0;

        pid_reset_integral_sum(&pitch_pid);
        pid_reset_integral_sum(&roll_pid);
        pid_reset_integral_sum(&vertical_velocity_pid);
        pid_reset_integral_sum(&yaw_pid);
    }
}


void handle_radio_communication(){
    if(nrf24_data_available(1)){
        nrf24_receive(rx_data);
        // Get the type of request
        extract_request_type(rx_data, strlen(rx_data), rx_type);

        if(strcmp(rx_type, "js") == 0){
            last_signal_timestamp = HAL_GetTick();

            // extract_joystick_request_values_uint(rx_data, strlen(rx_data), &throttle, &yaw, &roll, &pitch);
            extract_joystick_request_values_float(rx_data, strlen(rx_data), &throttle, &yaw, &roll, &pitch);

            // Reversed
            roll = (-(roll-50))+50;
            yaw = (-(yaw-50))+50;

            // For the blackbox log
            remote_control[0] = roll; // Reversed for blackbox log
            remote_control[1] = pitch-50;
            remote_control[2] = yaw-50;
            remote_control[3] = throttle+100;

            // the controls were inverse

            // If pitch and roll are neutral then try holding position with gps
            if(pitch == 50 && roll == 50 && gps_fix_type == 3 && use_gps_hold && gps_target_set == 0){
                gps_position_hold_enabled = 1;
                // Current gps position is the target now
                target_latitude = gps_latitude;
                target_longitude = gps_longitude;
                gps_target_set = 1;
                printf("GPS STATE SET\n");
            }else if (pitch != 50 || roll != 50 ){
                if(use_gps_reset_count >= use_gps_reset_count_to_deactivate){
                    gps_position_hold_enabled = 0;
                    gps_target_set = 0;
                    printf("GPS STATE RESET, GPS FIX %d\n", gps_fix_type);
                    use_gps_reset_count = 0;
                }else{
                    use_gps_reset_count++;
                }
            }

            // Pitch ##################################################################################################################
            // Check if pitch is neutral
            if(pitch == 50){
                // Had some issues with floats not being zero.
                // If value is between pitch attack and negative pitch attack then just set it to zero
                if(target_pitch < pitch_attack_step/2 && target_pitch > -pitch_attack_step/2){
                    target_pitch = 0.0;
                }
                // If value is above pitch attack values 
                // Start slowing going back to zero
                if(target_pitch > 0 && target_pitch != 0){
                    target_pitch = target_pitch - pitch_attack_step;
                }else if(target_pitch < 0  && target_pitch != 0){
                    target_pitch = target_pitch + pitch_attack_step;
                }
            }else if (pitch != 50){
                // If pitch is not neutral start increasing into some direction.
                target_pitch = target_pitch + map_value(pitch, 0.0, 100.0, -pitch_attack_step, pitch_attack_step);
            }

            // Make sure that the value is in the boundaries
            if(target_pitch > max_pitch_attack){
                target_pitch = max_pitch_attack;
            }else if(target_pitch < -max_pitch_attack){
                target_pitch = -max_pitch_attack;
            }


            // Roll ##################################################################################################################
            // Check if roll is neutral
            if(roll == 50){
                // Had some issues with floats not being zero.
                // If value is between roll attack and negative roll attack then just set it to zero
                if(target_roll < roll_attack_step/2 && target_roll > -roll_attack_step/2){
                    target_roll = 0.0;
                }
                // If value is above roll attack values 
                // Start slowing going back to zero
                if(target_roll > 0 && target_roll != 0){
                    target_roll = target_roll - roll_attack_step;
                }else if(target_roll < 0  && target_roll != 0){
                    target_roll = target_roll + roll_attack_step;
                }
            }else if (roll != 50){
                // If roll is not neutral start increasing into some direction.
                target_roll = target_roll + map_value(roll, 0.0, 100.0, -roll_attack_step, roll_attack_step);
            }

            // Make sure that the value is in the boundaries
            if(target_roll > max_roll_attack){
                target_roll = max_roll_attack;
            }else if(target_roll < -max_roll_attack){
                target_roll = -max_roll_attack;
            }

            // Yaw ##################################################################################################################
            if(yaw != 50){
                // There is an issue with the remote sometimes sending a 0 yaw
                // target_yaw = imu_orientation[2] + map_value(yaw, 0.0, 100.0, -max_yaw_attack, max_yaw_attack);
                // // handle the switch from -180 to 180 degrees
                // if(target_yaw > 180.0){
                //     target_yaw = target_yaw - 360.0;
                // }else if(target_yaw < -180.0){
                //     target_yaw = target_yaw + 360.0;
                // }

                target_yaw = map_value(yaw, 0.0, 100.0, -max_yaw_attack, max_yaw_attack);
            }else{
                target_yaw = 0;
            }

